
#include <iostream>
#include <string>
using namespace std;

//Зад1. Въвежда се число n -> дали n е просто.

//Зад2. Въвежда се число n -> разбиване на прости множители (! единствено)
// 19 = 19
// 96 = 2*2*2*2*2*3 = 2^5 + 3

// 1400 = 2^3 x 5^2 x 7^1.

//Зад3. Въвежда се неотрицателно число n -> изкараме n+1. - само цикли и побитови операции

//  0000..10001 
//        10010
//        10011
//        10100

// 1110101101111
// 1110101110000
             

// Зад4. Въвежда се нетроцателно число n и неотрицателно число k - n+k, само с цикли и побитови операции.


//Зад 5. Въвеждат се n и k.  n*k  само с цикли и побитови операции.

//Зад 6:  Всяко ест. число се представя по единствен начин като сума на различни степени на 2-ката.
//  10 =  2^1 + 2^3
//  26 = 2^1 + 2^3 + 2^4
// Изпечатайте това разбиване.

// 26 =  11010
int main()
{
	unsigned int n;
	cin >> n;


	int currentPosition = 0;
	while (n != 0)
	{
		if (n % 2 == 1) //проверка за последния бит 
		{
			cout << "2^" << currentPosition << " ";
		}
		currentPosition++;
		n >>= 1; //  n /=2;
	}

	

}